# CategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClassificationEntry..::..CategoryId Property
ClassificationEntry Class See Also
---
The id of the category associated with this entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId CategoryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CategoryId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
```

# See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace